In [50]:
# derste aldığım notlar

import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-1.04137035, -0.45549471,  0.28248545],
       [ 1.38296394, -0.20199399, -1.93194993],
       [-0.17699949,  0.1947004 ,  0.13877737],
       [ 1.1942208 ,  0.45144903, -0.87930724]])

In [4]:
dataFrame = pd.DataFrame(data)

In [55]:
dataFrame

          0         1         2
0 -1.041370 -0.455495  0.282485
1  1.382964 -0.201994 -1.931950
2 -0.176999  0.194700  0.138777
3  1.194221  0.451449 -0.879307

In [6]:
dataFrame[0]

0   -1.041370
1    1.382964
2   -0.176999
3    1.194221
Name: 0, dtype: float64

In [7]:
dataFrame[1]

0   -0.455495
1   -0.201994
2    0.194700
3    0.451449
Name: 1, dtype: float64

In [8]:
dataFrame[2]

0    0.282485
1   -1.931950
2    0.138777
3   -0.879307
Name: 2, dtype: float64

In [9]:
dataFrame[2]

0    0.282485
1   -1.931950
2    0.138777
3   -0.879307
Name: 2, dtype: float64

In [10]:
yeniDataFrame = pd.DataFrame(data,index=["Ahmet","zeynep","atlas","mehmet"],columns = ["maaş","yaş","çalışma saateri"])

In [11]:
yeniDataFrame

            maaş       yaş  çalışma saateri
Ahmet  -1.041370 -0.455495         0.282485
zeynep  1.382964 -0.201994        -1.931950
atlas  -0.176999  0.194700         0.138777
mehmet  1.194221  0.451449        -0.879307

In [12]:
yeniDataFrame[["maaş","yaş"]] #sütün yazıyoruz

            maaş       yaş
Ahmet  -1.041370 -0.455495
zeynep  1.382964 -0.201994
atlas  -0.176999  0.194700
mehmet  1.194221  0.451449

In [13]:
yeniDataFrame.loc["Ahmet"]  #burada ise .loc komutu kullanınca satırda yazabiliyoruz

maaş              -1.041370
yaş               -0.455495
çalışma saateri    0.282485
Name: Ahmet, dtype: float64

In [14]:
yeniDataFrame.loc["zeynep"]

maaş               1.382964
yaş               -0.201994
çalışma saateri   -1.931950
Name: zeynep, dtype: float64

In [15]:
yeniDataFrame.iloc[1] #.iloc[] index location 1.index e sahip satırı getirir

maaş               1.382964
yaş               -0.201994
çalışma saateri   -1.931950
Name: zeynep, dtype: float64

In [16]:
yeniDataFrame["Emeklilik yaşı"] = yeniDataFrame["yaş"] + yeniDataFrame["yaş"] #ekleme yapmak

In [17]:
yeniDataFrame

            maaş       yaş  çalışma saateri  Emeklilik yaşı
Ahmet  -1.041370 -0.455495         0.282485       -0.910989
zeynep  1.382964 -0.201994        -1.931950       -0.403988
atlas  -0.176999  0.194700         0.138777        0.389401
mehmet  1.194221  0.451449        -0.879307        0.902898

In [18]:
yeniDataFrame.drop("Emeklilik yaşı", axis=1)

            maaş       yaş  çalışma saateri
Ahmet  -1.041370 -0.455495         0.282485
zeynep  1.382964 -0.201994        -1.931950
atlas  -0.176999  0.194700         0.138777
mehmet  1.194221  0.451449        -0.879307

In [19]:
yeniDataFrame.drop("mehmet",axis = 0)  #axis eksen demek x ve y ekseni gibi düşün x=0 , y=1

            maaş       yaş  çalışma saateri  Emeklilik yaşı
Ahmet  -1.041370 -0.455495         0.282485       -0.910989
zeynep  1.382964 -0.201994        -1.931950       -0.403988
atlas  -0.176999  0.194700         0.138777        0.389401

In [20]:
yeniDataFrame #mehmet ve emeklilik yaşını çıkarmış olsak bile orjinal dizi bozulmadı

            maaş       yaş  çalışma saateri  Emeklilik yaşı
Ahmet  -1.041370 -0.455495         0.282485       -0.910989
zeynep  1.382964 -0.201994        -1.931950       -0.403988
atlas  -0.176999  0.194700         0.138777        0.389401
mehmet  1.194221  0.451449        -0.879307        0.902898

In [21]:
yeniDataFrame.drop("Emeklilik yaşı", axis=1,inplace=True)

In [22]:
yeniDataFrame #yukardaki inplace komutu orijinal diziyi değiştirdi

            maaş       yaş  çalışma saateri
Ahmet  -1.041370 -0.455495         0.282485
zeynep  1.382964 -0.201994        -1.931950
atlas  -0.176999  0.194700         0.138777
mehmet  1.194221  0.451449        -0.879307

inplace=True orijinal data frame i değiştirmek için kullanılıyor

In [23]:
yeniDataFrame.loc["Ahmet"]["yaş"]

-0.45549470959667193

In [24]:
yeniDataFrame.loc["Ahmet","yaş"] # bir üstteki komutla aynı işi yapar

-0.45549470959667193

In [25]:
yeniDataFrame

            maaş       yaş  çalışma saateri
Ahmet  -1.041370 -0.455495         0.282485
zeynep  1.382964 -0.201994        -1.931950
atlas  -0.176999  0.194700         0.138777
mehmet  1.194221  0.451449        -0.879307

In [26]:
yeniDataFrame < 0

         maaş    yaş  çalışma saateri
Ahmet    True   True            False
zeynep  False   True             True
atlas    True  False            False
mehmet  False  False             True

In [27]:
yeniDataFrame[yeniDataFrame["yaş"]>0]

            maaş       yaş  çalışma saateri
atlas  -0.176999  0.194700         0.138777
mehmet  1.194221  0.451449        -0.879307

In [28]:
yeniDataFrame.reset_index() # .reset_index() indexi değiştirmek istersek kullanırız.

    index      maaş       yaş  çalışma saateri
0   Ahmet -1.041370 -0.455495         0.282485
1  zeynep  1.382964 -0.201994        -1.931950
2   atlas -0.176999  0.194700         0.138777
3  mehmet  1.194221  0.451449        -0.879307

In [29]:
yeniDataFrame #yukarıdaki .reset_index komutunda inplace kullanmadığımız için orijinal diziyi değiştirmemiş

            maaş       yaş  çalışma saateri
Ahmet  -1.041370 -0.455495         0.282485
zeynep  1.382964 -0.201994        -1.931950
atlas  -0.176999  0.194700         0.138777
mehmet  1.194221  0.451449        -0.879307

In [30]:
yeniIndexListesi = ["ahm","zey","atl","meh"]

In [31]:
yeniDataFrame["yeni index"] = yeniIndexListesi

In [32]:
yeniDataFrame #şuan "yeni index" olarak bir kolon(sütun) getirdik

            maaş       yaş  çalışma saateri yeni index
Ahmet  -1.041370 -0.455495         0.282485        ahm
zeynep  1.382964 -0.201994        -1.931950        zey
atlas  -0.176999  0.194700         0.138777        atl
mehmet  1.194221  0.451449        -0.879307        meh

In [33]:
yeniDataFrame.set_index("yeni index", inplace=True) # burada "yeni index" sütununu index yaptık

In [34]:
yeniDataFrame

                maaş       yaş  çalışma saateri
yeni index
ahm        -1.041370 -0.455495         0.282485
zey         1.382964 -0.201994        -1.931950
atl        -0.176999  0.194700         0.138777
meh         1.194221  0.451449        -0.879307

# Multı Index kullanımı

In [35]:
ilkIndexler = ["Simpson","Simpson","Simpson","South park","South park","South park"]

In [36]:
icIndexler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [37]:
birlesmisIndex = list(zip(ilkIndexler,icIndexler))

In [38]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South park', 'Cartman'),
 ('South park', 'Kenny'),
 ('South park', 'Kyle')]

In [39]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [96]:
type(birlesmisIndex)

list

In [40]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South park', 'Cartman'),
            ('South park',   'Kenny'),
            ('South park',    'Kyle')],
           )

In [41]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [42]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [45]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndex,columns=["yaş","meslek"])

In [46]:
cizgiFilmDataFrame

                   yaş meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [47]:
cizgiFilmDataFrame.loc["Simpson"]

      yaş meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [49]:
cizgiFilmDataFrame.loc["South park"].loc["Kenny"]

yaş       10
meslek     E
Name: Kenny, dtype: object

In [50]:
cizgiFilmDataFrame

                   yaş meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [53]:
cizgiFilmDataFrame.index = ["Film adı", "İsim"] # index lere isim adı verdik

In [57]:
cizgiFilmDataFrame

                   yaş meslek
Film adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South park Cartman   9      D
           Kenny    10      E
           Kyle     11      F